app/controllers/static_controller.rb

SELECT "events".* FROM "events"
---
  def admindashboard
    @events = Event.all